##

# 테스트 문제

In [2]:
import seaborn as sns 

tips = sns.load_dataset("tips")
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## 문제
- total_bill이 20보다 큰 행들만 필터링하세요.

In [3]:
# 코드
# .reset_index(drop=True) : 인덱스 재정렬하기
result1 = tips.loc[tips["total_bill"] >= 20, :].head(1).reset_index(drop=True)
result1

   total_bill  tip   sex smoker  day    time  size
0       21.01  3.5  Male     No  Sun  Dinner     3

- total_bill이 20보다 크고 tip이 3보다 큰 행들만 필터링하세요.

In [4]:
# 코드
result2 = tips.loc[(tips['total_bill'] >= 20) & (tips['tip'] >= 3), :].reset_index(drop=True)
result2

    total_bill   tip     sex smoker  day    time  size
0        21.01  3.50    Male     No  Sun  Dinner     3
1        23.68  3.31    Male     No  Sun  Dinner     2
2        24.59  3.61  Female     No  Sun  Dinner     4
3        25.29  4.71    Male     No  Sun  Dinner     4
4        26.88  3.12    Male     No  Sun  Dinner     4
..         ...   ...     ...    ...  ...     ...   ...
71       28.15  3.00    Male    Yes  Sat  Dinner     5
72       30.14  3.09  Female    Yes  Sat  Dinner     4
73       20.45  3.00    Male     No  Sat  Dinner     4
74       35.83  4.67  Female     No  Sat  Dinner     3
75       29.03  5.92    Male     No  Sat  Dinner     3

[76 rows x 7 columns]

## 문제 
- Sun, Sat만 출력

In [5]:
tips['day'].unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [6]:
# code
result2 = tips.loc[tips['day'].isin(['Sun','Sat'])].reset_index(drop=True).shape
result2

(163, 7)

## 문제
- New가 들어간 도시만 출력
- contains 메서드 활용

In [7]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'city': ['New York', 'Los Angeles', 'New Yorker', 'Chicago', 'New City'],
    'age': [25, 30, 35, 40, 45]
}

df = pd.DataFrame(data)
df

      name         city  age
0    Alice     New York   25
1      Bob  Los Angeles   30
2  Charlie   New Yorker   35
3    David      Chicago   40
4      Eva     New City   45

In [8]:
# code
df.loc[df['city'].str.contains('New'), :].reset_index(drop=True)

      name        city  age
0    Alice    New York   25
1  Charlie  New Yorker   35
2      Eva    New City   45

## GroupBy
- 데이터셋.groupby(컬럼명).집계함수
    + 해당 컬럼은 범주 형태
- 포인트 1. 데이터형태가 바뀜
    + 내가 추가적인 조작

In [12]:
# 남자와 여자 중 누가 팁을 더 많이 줄까?
tips.groupby('sex', observed=True)['tip'].mean()

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

In [13]:
tips.groupby('sex', observed=True)['tip'].mean().reset_index()

      sex       tip
0    Male  3.089618
1  Female  2.833448

In [19]:
result = tips.groupby(['sex', 'day', 'smoker'], observed=True)['tip'].mean()
result.reset_index()

       sex   day smoker       tip
0     Male  Thur    Yes  3.058000
1     Male  Thur     No  2.941500
2     Male   Fri    Yes  2.741250
3     Male   Fri     No  2.500000
4     Male   Sat    Yes  2.879259
5     Male   Sat     No  3.256563
6     Male   Sun    Yes  3.521333
7     Male   Sun     No  3.115349
8   Female  Thur    Yes  2.990000
9   Female  Thur     No  2.459600
10  Female   Fri    Yes  2.682857
11  Female   Fri     No  3.125000
12  Female   Sat    Yes  2.868667
13  Female   Sat     No  2.724615
14  Female   Sun    Yes  3.500000
15  Female   Sun     No  3.329286

In [21]:
tips.groupby(['sex', 'day', 'smoker'], observed=True)['tip'].agg(['mean', 'std', 'max', 'min']).reset_index()

       sex   day smoker      mean       std    max   min
0     Male  Thur    Yes  3.058000  1.111573   5.00  2.00
1     Male  Thur     No  2.941500  1.485623   6.70  1.44
2     Male   Fri    Yes  2.741250  1.166808   4.73  1.50
3     Male   Fri     No  2.500000  1.414214   3.50  1.50
4     Male   Sat    Yes  2.879259  1.744338  10.00  1.00
5     Male   Sat     No  3.256563  1.839749   9.00  1.25
6     Male   Sun    Yes  3.521333  1.417432   6.50  1.50
7     Male   Sun     No  3.115349  1.216401   6.00  1.32
8   Female  Thur    Yes  2.990000  1.204049   5.00  2.00
9   Female  Thur     No  2.459600  1.078369   5.17  1.25
10  Female   Fri    Yes  2.682857  1.058013   4.30  1.00
11  Female   Fri     No  3.125000  0.176777   3.25  3.00
12  Female   Sat    Yes  2.868667  1.461378   6.50  1.00
13  Female   Sat     No  2.724615  0.961904   4.67  1.00
14  Female   Sun    Yes  3.500000  0.408248   4.00  3.00
15  Female   Sun     No  3.329286  1.282356   5.20  1.01